# FormatOptions Constructor (FormatOptions) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions Constructor (FormatOptions)
FormatOptions Class See Also
---
Creates a copy of a FormatOptions object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public FormatOptions(
	FormatOptions other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As FormatOptions _
)
```

Visual C++
---
```text
public:
FormatOptions(
	FormatOptions^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB..::..FormatOptions
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FormatOptions Class
FormatOptions Overload
Autodesk.Revit.DB Namespace